In [1]:
import pandas as pd
# DataFrame base con información de ventas
ventas = pd.DataFrame({
    "region": ["Norte", "Norte", "Sur", "Sur", "Este", "Este", "Oeste", "Oeste"],
    "mes": ["Enero", "Febrero", "Enero", "Febrero", "Enero", "Febrero", "Enero", "Febrero"],
    "producto": ["Laptop", "Laptop", "Mouse", "Laptop", "Mouse", "Mouse", "Laptop", "Mouse"],
    "categoria": ["Tecnología", "Tecnología", "Accesorios", "Tecnología",
                  "Accesorios", "Accesorios", "Tecnología", "Accesorios"],
    "ventas": [20000, 25000, 3000, 18000, 2500, 2800, 22000, 3200]
})

In [2]:
ventas

  region      mes producto   categoria  ventas
0  Norte    Enero   Laptop  Tecnología   20000
1  Norte  Febrero   Laptop  Tecnología   25000
2    Sur    Enero    Mouse  Accesorios    3000
3    Sur  Febrero   Laptop  Tecnología   18000
4   Este    Enero    Mouse  Accesorios    2500
5   Este  Febrero    Mouse  Accesorios    2800
6  Oeste    Enero   Laptop  Tecnología   22000
7  Oeste  Febrero    Mouse  Accesorios    3200

In [3]:
# Ventas totales por región y mes
pivot_region_mes = pd.pivot_table(
    ventas,
    values="ventas",
    index="region",
    columns="mes",
    aggfunc="sum",
    fill_value=0,
    margins=True
)

pivot_region_mes

mes     Enero  Febrero    All
region
Este     2500     2800   5300
Norte   20000    25000  45000
Oeste   22000     3200  25200
Sur      3000    18000  21000
All     47500    49000  96500

In [4]:
# Promedio de ventas por producto y región
pivot_producto_region = pd.pivot_table(
    ventas,
    values="ventas",
    index="producto",
    columns="region",
    aggfunc="mean",
    fill_value=0
)

pivot_producto_region

region      Este    Norte    Oeste      Sur
producto
Laptop       0.0  22500.0  22000.0  18000.0
Mouse     2650.0      0.0   3200.0   3000.0

In [7]:
# Múltiples métricas de ventas por categoría y mes
pivot_categoria_mes = pd.pivot_table(
    ventas,
    values="ventas",
    index="categoria",
    columns="mes",
    aggfunc=["sum", "mean", "max"],
    fill_value=0
)

pivot_categoria_mes

              sum             mean             max
mes         Enero Febrero    Enero  Febrero  Enero Febrero
categoria
Accesorios   5500    6000   2750.0   3000.0   3000    3200
Tecnología  42000   43000  21000.0  21500.0  22000   25000